workloads/vllm/uvm/results-100-5-512/logs-2/20251208_021937_lmcache_client.log
Command: uv run vllm bench serve --model Qwen/Qwen3-30B-A3B-FP8 --dataset-name sharegpt --num-prompts 100 --dataset-path /home/yunwei37/workspace/gpu/schedcp/workloads/vllm/datasets/ShareGPT_V3_unfiltered_cleaned_split.json --seed 42 --request-rate 5
Timestamp: 2025-12-08T02:22:22.381373
============================================================
STDOUT:
INFO 12-08 02:20:03 [__init__.py:216] Automatically detected platform cuda.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x72fd149ca660>, seed=42, num_prompts=100, dataset_name='sharegpt', no_stream=False, dataset_path='/home/yunwei37/workspace/gpu/schedcp/workloads/vllm/datasets/ShareGPT_V3_unfiltered_cleaned_split.json', no_oversample=False, custom_output_len=256, custom_skip_chat_template=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1024, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 0}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', endpoint_type=None, base_url=None, host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='Qwen/Qwen3-30B-A3B-FP8', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=5.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=False, percentile_metrics='ttft,tpot,itl', metric_percentiles='99', goodput=None, request_id_prefix='benchmark-serving', top_p=None, top_k=None, min_p=None, temperature=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600)
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
Initial test run completed. Starting main benchmark run...
Traffic request rate: 5.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Request rate configured (RPS):           5.00      
Benchmark duration (s):                  131.03    
Total input tokens:                      21566     
Total generated tokens:                  25066     
Request throughput (req/s):              0.76      
Output token throughput (tok/s):         191.30    
Peak output token throughput (tok/s):    478.00    
Peak concurrent requests:                85.00     
Total Token throughput (tok/s):          355.89    
---------------Time to First Token----------------
Mean TTFT (ms):                          798.20    
Median TTFT (ms):                        670.65    
P99 TTFT (ms):                           2073.64   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          221.72    
Median TPOT (ms):                        200.25    
P99 TPOT (ms):                           509.91    
---------------Inter-token Latency----------------
Mean ITL (ms):                           175.48    
Median ITL (ms):                         172.98    
P99 ITL (ms):                            787.87    
==================================================

============================================================
STDERR:

 |          | 00:00 elapsed, ? remaining
 |          | 00:00 elapsed, 00:04 remaining
 |          | 00:03 elapsed, 575:36:42 remaining

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:03<05:44,  3.48s/it]
  2%|▏         | 2/100 [00:09<08:31,  5.22s/it]
  3%|▎         | 3/100 [00:10<05:07,  3.17s/it]
  4%|▍         | 4/100 [00:10<03:16,  2.04s/it]
  5%|▌         | 5/100 [00:11<02:09,  1.37s/it]
  6%|▌         | 6/100 [00:11<01:33,  1.00it/s]
  7%|▋         | 7/100 [00:12<01:31,  1.02it/s]
  8%|▊         | 8/100 [00:13<01:21,  1.13it/s]
  9%|▉         | 9/100 [00:13<01:01,  1.48it/s]
 10%|█         | 10/100 [00:14<01:14,  1.21it/s]
 11%|█         | 11/100 [00:15<01:10,  1.27it/s]
 12%|█▏        | 12/100 [00:15<00:55,  1.57it/s]
 13%|█▎        | 13/100 [00:15<00:43,  2.00it/s]
 14%|█▍        | 14/100 [00:16<00:43,  1.98it/s]
 15%|█▌        | 15/100 [00:16<00:34,  2.44it/s]
 16%|█▌        | 16/100 [00:19<01:41,  1.21s/it]
 17%|█▋        | 17/100 [00:19<01:14,  1.11it/s]
 18%|█▊        | 18/100 [00:21<01:36,  1.17s/it]
 19%|█▉        | 19/100 [00:22<01:24,  1.05s/it]
 20%|██        | 20/100 [00:22<01:03,  1.27it/s]
 21%|██        | 21/100 [00:22<00:47,  1.65it/s]
 22%|██▏       | 22/100 [00:22<00:37,  2.09it/s]
 23%|██▎       | 23/100 [00:23<00:34,  2.25it/s]
 24%|██▍       | 24/100 [00:23<00:31,  2.39it/s]
 27%|██▋       | 27/100 [00:23<00:18,  3.99it/s]
 28%|██▊       | 28/100 [00:24<00:19,  3.67it/s]
 30%|███       | 30/100 [00:24<00:14,  4.93it/s]
 31%|███       | 31/100 [00:24<00:18,  3.65it/s]
 32%|███▏      | 32/100 [00:25<00:20,  3.38it/s]
 33%|███▎      | 33/100 [00:25<00:23,  2.81it/s]
 34%|███▍      | 34/100 [00:25<00:20,  3.24it/s]
 36%|███▌      | 36/100 [00:26<00:13,  4.62it/s]
 37%|███▋      | 37/100 [00:28<00:41,  1.51it/s]
 38%|███▊      | 38/100 [00:28<00:41,  1.48it/s]
 39%|███▉      | 39/100 [00:29<00:38,  1.57it/s]
 40%|████      | 40/100 [00:31<00:54,  1.11it/s]
 41%|████      | 41/100 [00:31<00:41,  1.43it/s]
 42%|████▏     | 42/100 [00:33<01:08,  1.18s/it]
 43%|████▎     | 43/100 [00:36<01:31,  1.61s/it]
 44%|████▍     | 44/100 [00:38<01:41,  1.81s/it]
 45%|████▌     | 45/100 [00:41<01:57,  2.13s/it]
 46%|████▌     | 46/100 [00:42<01:43,  1.92s/it]
 47%|████▋     | 47/100 [00:43<01:19,  1.51s/it]
 48%|████▊     | 48/100 [00:43<01:00,  1.16s/it]
 49%|████▉     | 49/100 [00:44<00:55,  1.08s/it]
 50%|█████     | 50/100 [00:45<00:56,  1.13s/it]
 51%|█████     | 51/100 [00:46<00:49,  1.01s/it]
 52%|█████▏    | 52/100 [00:46<00:39,  1.23it/s]
 53%|█████▎    | 53/100 [00:50<01:21,  1.73s/it]
 54%|█████▍    | 54/100 [00:53<01:26,  1.88s/it]
 55%|█████▌    | 55/100 [00:53<01:11,  1.59s/it]
 56%|█████▌    | 56/100 [00:54<00:55,  1.27s/it]
 57%|█████▋    | 57/100 [00:56<01:07,  1.57s/it]
 58%|█████▊    | 58/100 [00:57<00:57,  1.36s/it]
 59%|█████▉    | 59/100 [01:01<01:21,  1.98s/it]
 60%|██████    | 60/100 [01:01<01:03,  1.59s/it]
 61%|██████    | 61/100 [01:06<01:42,  2.64s/it]
 62%|██████▏   | 62/100 [01:07<01:19,  2.09s/it]
 63%|██████▎   | 63/100 [01:08<00:59,  1.61s/it]
 64%|██████▍   | 64/100 [01:08<00:42,  1.18s/it]
 65%|██████▌   | 65/100 [01:10<00:52,  1.51s/it]
 67%|██████▋   | 67/100 [01:14<00:55,  1.68s/it]
 68%|██████▊   | 68/100 [01:14<00:43,  1.35s/it]
 69%|██████▉   | 69/100 [01:15<00:40,  1.31s/it]
 70%|███████   | 70/100 [01:17<00:40,  1.34s/it]
 71%|███████   | 71/100 [01:17<00:30,  1.05s/it]
 72%|███████▏  | 72/100 [01:20<00:40,  1.46s/it]
 73%|███████▎  | 73/100 [01:20<00:34,  1.26s/it]
 74%|███████▍  | 74/100 [01:21<00:24,  1.07it/s]
 75%|███████▌  | 75/100 [01:22<00:29,  1.18s/it]
 76%|███████▌  | 76/100 [01:23<00:22,  1.09it/s]
 77%|███████▋  | 77/100 [01:23<00:15,  1.45it/s]
 78%|███████▊  | 78/100 [01:25<00:24,  1.09s/it]
 79%|███████▉  | 79/100 [01:27<00:27,  1.32s/it]
 80%|████████  | 80/100 [01:27<00:22,  1.13s/it]
 81%|████████  | 81/100 [01:33<00:46,  2.47s/it]
 82%|████████▏ | 82/100 [01:33<00:33,  1.85s/it]
 83%|████████▎ | 83/100 [01:34<00:23,  1.37s/it]
 84%|████████▍ | 84/100 [01:34<00:17,  1.07s/it]
 85%|████████▌ | 85/100 [01:38<00:29,  1.98s/it]
 86%|████████▌ | 86/100 [01:42<00:35,  2.54s/it]
 87%|████████▋ | 87/100 [01:44<00:30,  2.31s/it]
 89%|████████▉ | 89/100 [01:45<00:18,  1.66s/it]
 90%|█████████ | 90/100 [01:47<00:16,  1.69s/it]
 91%|█████████ | 91/100 [01:48<00:13,  1.49s/it]
 92%|█████████▏| 92/100 [01:53<00:20,  2.51s/it]
 93%|█████████▎| 93/100 [01:54<00:14,  2.00s/it]
 94%|█████████▍| 94/100 [01:59<00:16,  2.82s/it]
 95%|█████████▌| 95/100 [01:59<00:10,  2.13s/it]
 96%|█████████▌| 96/100 [02:01<00:08,  2.10s/it]
 97%|█████████▋| 97/100 [02:02<00:04,  1.55s/it]
 98%|█████████▊| 98/100 [02:02<00:02,  1.16s/it]
 99%|█████████▉| 99/100 [02:03<00:01,  1.00s/it]
100%|██████████| 100/100 [02:11<00:00,  3.09s/it]
100%|██████████| 100/100 [02:11<00:00,  1.31s/it]